/*
[관리자 기능]
        상영관을 여러개 만들 수 있다.
        상영관을 없앨 수 있다.
        상영관에 여러 좌석을 만들 수 있다.
        상영관에 좌석을 없앨 수 있다.

        상영관에 영화를 등록할 수 있다.
        상영관에 등록된 영화관을 제거할 수 있다.
        상영관에 등록된 영화관을 수정할 수 있다.

        상영관에 등록된 좌석을 조회할 수 있다.
        상영관에 등록된 영화를 조회할 수 있다.


        [사용자(유저) 기능]
        예매를 할 수 있다.
        예매 과정 -> 상영관에 등록된 영화를 조회할 수 있다. -> 상영관에 빈 좌석을 조회할 수 있다. -> 해당 좌석을 예약한다.

        예매를 취소할 수 있다.
        예매 취소과정 -> 예매 시 출력된 티켓 번호를 통해 자신이 예매한 것을 조회할 수 있다. -> 조회된 예매를 취소할 수 있다.


        =====추가======
        실제 영화를 인터넷에서 막 가져오는 것을 의미하는 것은 아님.
        예)
        [영화 티켓 예매 시스템]
        1. 관리자
        2. 사용자
        > 선택하세요 : 1

//관리자를 선택했을 때
        [관리자 메뉴]
        1. 상영관 등록
        2. 상영관 삭제
        3. 영화 등록
        4. 영화 삭제
        5. 상영관 영화 등록
        6. 상영관 영화 삭제
        7. 상영관에 등록된 영화 수정
        8. 상영관 조회
        9. 영화 조회

//사용자를 선택했을 때
        [사용자 메뉴]
        1. 예매하기
        2. 예매취소*/
